Assignment day 3

In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item', sep='\t')

In [3]:
dataset.head()

  item_code  ... sort_sequence
0       AA0  ...             2
1      AA0R  ...           399
2       SA0  ...             1
3      SA0E  ...           374
4     SA0L1  ...           358

[5 rows x 5 columns]

In [4]:
dataset.tail()

    item_code  ... sort_sequence
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[5 rows x 5 columns]

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 399 entries, 0 to 398
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_code      399 non-null    object
 1   item_name      399 non-null    object
 2   display_level  399 non-null    int64
 3   selectable     399 non-null    object
 4   sort_sequence  399 non-null    int64
dtypes: int64(2), object(3)
memory usage: 15.7+ KB

In [8]:
dataset['item_code'].unique()

array(['AA0', 'AA0R', 'SA0', 'SA0E', 'SA0L1', 'SA0L12', 'SA0L12E',
       'SA0L12E4', 'SA0L1E', 'SA0L2', 'SA0L5', 'SA0LE', 'SA0R', 'SA311',
       'SAA', 'SAA1', 'SAA2', 'SAC', 'SACE', 'SACL1', 'SACL11', 'SACL1E',
       'SACL1E4', 'SAD', 'SAE', 'SAE1', 'SAE2', 'SAE21', 'SAEC', 'SAES',
       'SAF', 'SAF1', 'SAF11', 'SAF111', 'SAF112', 'SAF1121', 'SAF11211',
       'SAF113', 'SAF1131', 'SAF114', 'SAF115', 'SAF116', 'SAG', 'SAG1',
       'SAGC', 'SAGS', 'SAH', 'SAH1', 'SAH2', 'SAH21', 'SAH3', 'SAH31',
       'SAM', 'SAM1', 'SAM2', 'SAN', 'SAN1D', 'SANL1', 'SANL11',
       'SANL113', 'SANL13', 'SAR', 'SARC', 'SARS', 'SAS', 'SAS24',
       'SAS2RS', 'SAS367', 'SAS4', 'SASL2RS', 'SASL5', 'SASLE', 'SAT',
       'SAT1', 'SATCLTB', 'SEAA', 'SEAA01', 'SEAA02', 'SEAA03', 'SEAA04',
       'SEAB', 'SEAC', 'SEAC01', 'SEAC02', 'SEAC03', 'SEAC04', 'SEAD',
       'SEAE', 'SEAE01', 'SEAE02', 'SEAE03', 'SEAF', 'SEAG', 'SEAG01',
       'SEAG02', 'SEEA', 'SEEB', 'SEEB01', 'SEEB02', 'SEEB03', 'SEEB04',
       'SEEC', 'SEEC01', 'SEEC02', 'SEED', 'SEED03', 'SEED04', 'SEEE',
       'SEEE01', 'SEEE02', 'SEEE03', 'SEEE04', 'SEEEC', 'SEFA', 'SEFA01',
       'SEFA02', 'SEFA03', 'SEFB', 'SEFB01', 'SEFB02', 'SEFB03', 'SEFB04',
       'SEFC', 'SEFC01', 'SEFC02', 'SEFC03', 'SEFC04', 'SEFD', 'SEFD01',
       'SEFD02', 'SEFD03', 'SEFD04', 'SEFE', 'SEFF', 'SEFF01', 'SEFF02',
       'SEFG', 'SEFG01', 'SEFG02', 'SEFH', 'SEFJ', 'SEFJ01', 'SEFJ02',
       'SEFJ03', 'SEFJ04', 'SEFK', 'SEFK01', 'SEFK02', 'SEFK03', 'SEFK04',
       'SEFL', 'SEFL01', 'SEFL02', 'SEFL03', 'SEFL04', 'SEFM', 'SEFM01',
       'SEFM02', 'SEFM03', 'SEFN', 'SEFN01', 'SEFN02', 'SEFN03', 'SEFP',
       'SEFP01', 'SEFP02', 'SEFR', 'SEFR01', 'SEFR02', 'SEFR03', 'SEFS',
       'SEFS01', 'SEFS02', 'SEFS03', 'SEFT', 'SEFT01', 'SEFT02', 'SEFT03',
       'SEFT04', 'SEFT05', 'SEFT06', 'SEFV', 'SEFV01', 'SEFV02', 'SEFV03',
       'SEFV04', 'SEFV05', 'SEFW', 'SEFW01', 'SEFW02', 'SEFW03', 'SEFX',
       'SEGA', 'SEGA01', 'SEGA02', 'SEGB', 'SEGB01', 'SEGB02', 'SEGC',
       'SEGC01', 'SEGD', 'SEGD01', 'SEGD02', 'SEGD03', 'SEGD04', 'SEGD05',
       'SEGE', 'SEHA', 'SEHB', 'SEHB01', 'SEHB02', 'SEHC', 'SEHC01',
       'SEHD', 'SEHE', 'SEHE01', 'SEHE02', 'SEHF', 'SEHF01', 'SEHF02',
       'SEHG', 'SEHG01', 'SEHG02', 'SEHH', 'SEHH01', 'SEHH02', 'SEHH03',
       'SEHJ', 'SEHJ01', 'SEHJ02', 'SEHJ03', 'SEHK', 'SEHK01', 'SEHK02',
       'SEHL', 'SEHL01', 'SEHL02', 'SEHL03', 'SEHL04', 'SEHM', 'SEHM01',
       'SEHM02', 'SEHN', 'SEHN01', 'SEHN02', 'SEHN03', 'SEHP', 'SEHP01',
       'SEHP02', 'SEHP03', 'SEHP04', 'SEMC', 'SEMC01', 'SEMC02', 'SEMC03',
       'SEMC04', 'SEMD', 'SEMD01', 'SEMD02', 'SEMD03', 'SEME', 'SEMF',
       'SEMF01', 'SEMF02', 'SEMG', 'SERA', 'SERA01', 'SERA02', 'SERA03',
       'SERA04', 'SERA05', 'SERA06', 'SERAC', 'SERAS', 'SERB', 'SERB01',
       'SERB02', 'SERC', 'SERC01', 'SERC02', 'SERD', 'SERD01', 'SERD02',
       'SERE', 'SERE01', 'SERE02', 'SERE03', 'SERF', 'SERF01', 'SERF02',
       'SERF03', 'SERG', 'SERG01', 'SERG02', 'SETA', 'SETA01', 'SETA02',
       'SETA03', 'SETA04', 'SETB', 'SETB01', 'SETB02', 'SETC', 'SETC01',
       'SETC02', 'SETD', 'SETD01', 'SETD02', 'SETD03', 'SETE', 'SETF',
       'SETF01', 'SETF03', 'SETG', 'SETG01', 'SETG02', 'SETG03',
       'SS01031', 'SS02011', 'SS02021', 'SS02041', 'SS02042', 'SS02063',
       'SS0206A', 'SS0206B', 'SS04011', 'SS04012', 'SS04031', 'SS05011',
       'SS05014', 'SS05015', 'SS0501A', 'SS06011', 'SS06021', 'SS07011',
       'SS07021', 'SS09011', 'SS09021', 'SS10011', 'SS11031', 'SS13031',
       'SS14011', 'SS14021', 'SS14022', 'SS16011', 'SS16014', 'SS17031',
       'SS17032', 'SS18041', 'SS18042', 'SS18043', 'SS1804B', 'SS18064',
       'SS20021', 'SS20022', 'SS20051', 'SS20052', 'SS20053', 'SS27051',
       'SS27061', 'SS30021', 'SS31022', 'SS31023', 'SS33032', 'SS45011',
       'SS4501A', 'SS45021', 'SS45031', 'SS47014', 'SS47015', 'SS47016',
       'SS47021', 'SS48021', 'SS52051', 'SS53021', 'SS53022', 'SS53023',
       'SS53031', 'SS5702', 'SS5703', 'SS61011', 'SS61021', 'SS61023',
       'SS61031', 'SS61032', 'SS62011', 'SS62031', 'SS62032', 'SS62051',
       'SS62052', 'SS62053', 'SS62054', 'SS62055', 'SS68021', 'SS68023',
       'SSEA011', 'SSFV031A', 'SSGE013', 'SSHJ031'], dtype=object)

In [9]:
dataset[dataset['display_level']==0]

   item_code  ... sort_sequence
0        AA0  ...             2
1       AA0R  ...           399
2        SA0  ...             1
12      SA0R  ...           398
14       SAA  ...           187
24       SAE  ...           311
30       SAF  ...             3
42       SAG  ...           335
46       SAH  ...           136
52       SAM  ...           250
61       SAR  ...           269
72       SAT  ...           210

[12 rows x 5 columns]

In [13]:
dataset[dataset['selectable'] == 'T']

    item_code  ... sort_sequence
0         AA0  ...             2
1        AA0R  ...           399
2         SA0  ...             1
3        SA0E  ...           374
4       SA0L1  ...           358
..        ...  ...           ...
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[399 rows x 5 columns]

In [14]:
dataset2 = dataset[dataset['sort_sequence']>=100]

In [15]:
dataset2['display_level'].unique()

array([0, 1, 2, 3, 4, 5, 6])

In [16]:
dataset['sort_sequence'].value_counts()

399    1
125    1
127    1
128    1
129    1
      ..
269    1
270    1
271    1
272    1
1      1
Name: sort_sequence, Length: 399, dtype: int64

In [17]:
dataset.iloc[:,2].describe()

count    399.000000
mean       3.192982
std        1.817102
min        0.000000
25%        2.000000
50%        3.000000
75%        4.000000
max        8.000000
Name: display_level, dtype: float64

In [18]:
dataset.corr()

               display_level  sort_sequence
display_level        1.00000       -0.70548
sort_sequence       -0.70548        1.00000

In [19]:
dataset3 = dataset
count_of_columns = dataset3.count()

In [20]:
count_of_columns

item_code        399
item_name        399
display_level    399
selectable       399
sort_sequence    399
dtype: int64

In [21]:
number_of_nan_rows = count_of_columns - dataset3.dropna(axis=0).count()
number_of_nan_rows

item_code        0
item_name        0
display_level    0
selectable       0
sort_sequence    0
dtype: int64

In [22]:
dataset[(dataset['display_level']<=2) & (dataset['sort_sequence']<=10)]

   item_code             item_name  display_level selectable  sort_sequence
0        AA0  All items - old base              0          T              2
2        SA0             All items              0          T              1
30       SAF    Food and beverages              0          T              3
31      SAF1                  Food              1          T              4
32     SAF11          Food at home              2          T              5